{
    "ID": {
        "header-title": "Pendataan Mahasiswa Indonesia di Malaysia",
        "subtext-1": "Formulir ini merupakan bagian dari",
        "subtext-highlight": "pendataan resmi KBRI Malaysia.",
        "subtext-2": "Data Anda akan digunakan untuk kepentingan administratif, pelayanan, dan kebutuhan darurat selama di Malaysia.",
        "btn-new": "Daftar Baru",
        "btn-update": "Perbarui Data",
        "update": "Perbarui",
        "full-name": "Nama Lengkap",
        "dob": "Tanggal Lahir",
        "passport": "Nomor Paspor",
        "phone": "Nomor Telepon",
        "university": "Universitas",
        "btn-login": "Masuk",
        "btn-next": "Selanjutnya",
        "email": "Email/Surel",
        "Address": "Alamat Lengkap",
        "postkode": "Kode Pos",
        "btn-prev": "Sebelumnya",
        "(mandatory)": "(wajib diisi)",
        "basic-info": "1. Informasi Dasar",
        "add-info": "2. Informasi Tambahan",
        "(optional)": "(opsional)",
        "uni-info": "3. Informasi Universitas",
        "edu-level": "Apa jenjang pendidikan yang sedang Anda kejar?",
        "programme": "Program studi apa yang sedang Anda kejar?",
        "grad-time": "Kapan perkiraan waktu kelulusan Anda?",
        "hellouniname": "Halo Pelajar",
        "hellouniname2": "!",
        "ppi": "Perkumpulan Pelajar Indonesia",
        "ulevel": "- Universitas",
        "ppicampusask": "Apakah Anda pernah atau saat ini menjadi",
        "ppicampusask2": "pengurus PPI di kampus Anda?",
        "ppi-yes": "Ya",
        "ppi-no": "Tidak",
        "start-year": "Tahun Mulai",
        "end-year": "Tahun Selesai",
        "department": "Departemen",
        "position": "Jabatan dalam departemen",
        "add-info2": "Informasi Tambahan",
        "ppim": "5. Perkumpulan Pelajar Indonesia di Malaysia",
        "ppimask": "pengurus PPI Malaysia?",
        "btn-save": "Selesai",
        "hello": "Halo",
        "cancel": "Kembali",
        "profile-instruction": "Di page ini kamu bisa memperbarui data diri kamu kapan saja. Data kamu akan dipakai untuk administrasi, layanan, dan keadaan darurat selama kamu berada di Malaysia. Beberapa data sensitif disamarkan supaya data kamu tetap aman.",
        "data-protection": "[Cara kami melindungi data kamu]",
        "personal-details": "Detail Pribadi",
        "address": "Alamat",
        "university-details": "Detail Universitas",
        "degree-programme": "Program Studi",
        "education-level": "Jenjang Pendidikan Saat Ini",
        "expected-graduation": "Perkiraan Waktu Kelulusan",
        "ppi-campus-record": "Riwayat PPI Kampus",
        "positioncol": "Jabatan",
        "year": "Tahun",
        "verification": "Verifikasi",
        "ppi-malaysia-record": "Riwayat PPI Malaysia",
        "ppi-campus-note": "Catatan: Jika kamu memilih “Ya,” perwakilan dari kampusmu akan memverifikasi apakah kamu benar anggota PPI di kampusmu. Jika kamu adalah perwakilan kampus dan butuh akses, silakan hubungi pengurus PPI Malaysia saat ini.",
        "ppi-campus-add-note": "Catatan: Kamu juga dapat menambahkan riwayat PPI dari universitas sebelumnya. Perwakilan dari kampus tersebut akan memverifikasi apakah kamu benar anggota PPI di kampus itu. Jika kamu adalah perwakilan kampus dan butuh akses, silakan hubungi pengurus PPI Malaysia saat ini.",
        "ppi-malaysia-note": "Catatan: Jika kamu memilih “Ya,” pengurus PPI Malaysia saat ini akan memverifikasi informasi kamu.",
        "ppi-malaysia-add-note": "Catatan: Pengurus PPI Malaysia saat ini akan memverifikasi informasi kamu.",
        "btn-me": "Ya, itu aku",
        "btn-not-me": "Tidak, itu bukan aku",
        "exist-student-desc": "Sepertinya data kamu sudah ada dalam sistem kami",
        "exist-student": "Data kamu sudah terdaftar",
        "whole": "Catatan: Kamu harus isi semua informasi dibawah!",
        "add": "Tambah",
        "delete-record": "Hapus Riwayat",
        "delete-note": "Dengan ini aku menghapus riwayat PPI-ku secara permanen dan paham bahwa tindakan ini tidak bisa dibatalkan.",
        "delete": "Hapus",
        "notfound": "Informasi Pelajar Tidak Ditemukan",
        "notfounddesc": "Data pelajar tidak ditemukan. Silakan periksa kembali informasi kamu atau buat pendaftaran baru."
    },
    "EN": {
        "header-title": "Indonesian Student Registration in Malaysia",
        "subtext-1": "This form is part of",
        "subtext-highlight": "the official data collection by the Indonesian Embassy (KBRI) in Malaysia.",
        "subtext-2": "Your data will be used for administrative purposes, services, and emergencies while in Malaysia.",
        "btn-new": "New Registration",
        "btn-update": "Update Profile",
        "update": "Update",
        "full-name": "Full Name",
        "dob": "Date of Birth",
        "passport": "Passport Number",
        "phone": "Phone Number",
        "university": "University",
        "btn-login": "Login",
        "btn-next": "Next",
        "email": "Email",
        "Address": "Full Address",
        "postkode": "Postcode",
        "btn-prev": "Previous",
        "(mandatory)": "(mandatory)",
        "basic-info": "1. Basic Information",
        "add-info": "2. Additional Information",
        "(optional)": "(optional)",
        "uni-info": "3. University Information",
        "edu-level": "What level of education are you currently pursuing?",
        "programme": "What degree program are you pursuing?",
        "grad-time": "When is your expected graduation time?",
        "hellouniname": "Hello",
        "hellouniname2": " Student!",
        "ppi": "Indonesian Student Association",
        "ulevel": "- University",
        "ppicampusask": "Are you currently, or have you ever been, a",
        "ppicampusask2": "member of PPI at your campus?",
        "ppi-yes": "Yes",
        "ppi-no": "No",
        "start-year": "Start Year",
        "end-year": "End Year",
        "department": "Department",
        "position": "Position in the department",
        "add-info2": "Additional Information",
        "ppim": "5. Indonesian Student Association in Malaysia",
        "ppimask": "member of PPI Malaysia?",
        "btn-save": "Save",
        "hello": "Hello",
        "cancel": "Cancel",
        "profile-instruction": "Here you can update your details anytime. Your info will be used for admin, services, and emergencies while you are in Malaysia. Some sensitive parts are redacted to keep your data safe.",
        "data-protection": "[See how we protect your data]",
        "personal-details": "Personal Details",
        "address": "Address",
        "university-details": "University Details",
        "degree-programme": "Degree Programme",
        "education-level": "Current Education Level",
        "expected-graduation": "Expected Graduation Date",
        "ppi-campus-record": "PPI Campus Record",
        "positioncol": "Position",
        "year": "Year",
        "verification": "Verification",
        "ppi-malaysia-record": "PPI Malaysia Record",
        "ppi-campus-note": "Note: If you choose “Yes,” a representative from your campus will verify whether you are a member of PPI at your campus. If you are a representative yourself and need access, please contact the current PPI Malaysia board.",
        "ppi-campus-add-note": "Note: You can also add your PPI record from your previous university. A representative from that campus will verify whether you are a member of PPI at that campus. If you are a representative yourself and need access, please contact the current PPI Malaysia board.",
        "ppi-malaysia-note": "Note: If you choose “Yes,” the current PPI Malaysia board will verify your information.",
        "ppi-malaysia-add-note": "Note: The current PPI Malaysia board will verify your information.",
        "btn-not-me": "No, That's not me",
        "btn-me": "Yes, That's me",
        "exist-student": "Existing Registration Found!",
        "exist-student-desc": "It looks like we had stored your data before.",
        "whole": "Note: You need to fill whole information below!",
        "add": "Add",
        "delete-record": "Delete Record",
        "delete-note": "I hereby confirm that I wish to permanently delete my PPI record and understand that this action cannot be undone.",
        "delete": "Delete",
        "notfound": "Student Information Not Found",
        "notfounddesc": "Student information not found. Please double-check your information or create a new registration."
    },
    "about-page": {
        "ID": {
            "back-to-home": "Kembali",
            "about-title": "Perlindungan & Privasi Data",
            "about-last-updated": "Terakhir diperbarui: 19 Oktober 2025",
            "about-purpose-title": "1. Tujuan Pengumpulan Data",
            "about-purpose-desc": "Ini adalah inisiatif pengumpulan data resmi untuk mahasiswa Indonesia di Malaysia, yang dikoordinasikan dengan Kedutaan Besar Republik Indonesia (KBRI). Data ini penting untuk dukungan administratif, penyediaan layanan mahasiswa, dan untuk keperluan kontak darurat.",
            "about-what-data-title": "2. Data Apa yang Kami Kumpulkan",
            "about-what-data-desc": "Kami mengumpulkan informasi berikut untuk memfasilitasi layanan kami:",
            "about-data-item-1": "<b>Identifikasi Pribadi:</b> Nama Lengkap, Tanggal Lahir, Nomor Paspor.",
            "about-data-item-2": "<b>Informasi Kontak:</b> Nomor Telepon, Email, Alamat Lengkap, dan Kode Pos.",
            "about-data-item-3": "<b>Data Pendidikan:</b> Universitas, Program Studi, Jenjang Pendidikan, dan Perkiraan Waktu Kelulusan.",
            "about-data-item-4": "<b>Riwayat Organisasi:</b> Catatan keterlibatan Anda di PPI Kampus dan PPI Malaysia.",
            "about-data-item-5": "<b>Data Teknis:</b> Kami mengumpulkan data teknis anonim, seperti lebar layar dan user-agent browser, untuk meningkatkan layanan kami dan memastikan keamanan.",
            "about-how-use-title": "3. Bagaimana Kami Menggunakan dan Membagikan Data Anda",
            "about-how-use-desc": "Data Anda digunakan secara eksklusif untuk tujuan resmi dan hanya dibagikan dalam keadaan tertentu:",
            "about-sharing-item-1": "<b>Penggunaan Utama:</b> Data disimpan di database utama PPI Malaysia untuk keperluan administrasi dan kontak darurat oleh personel yang berwenang.",
            "about-sharing-item-2": "<b>Verifikasi:</b> Jika Anda mengirimkan catatan untuk PPI Kampus atau PPI Malaysia, perwakilan yang ditunjuk dari organisasi tersebut akan dapat melihat dan memverifikasi status keanggotaan Anda. Ini dijelaskan dalam catatan di halaman pendaftaran dan profil.",
            "about-sharing-item-3": "<b>Pihak Ketiga:</b> Kami tidak menjual atau membagikan data pribadi Anda dengan pihak ketiga yang tidak berwenang. Akses sangat terbatas pada personel PPI Kampus Anda dan KBRI untuk tugas-tugas resmi.",
            "about-security-title": "4. Bagaimana Kami Melindungi Data Anda",
            "about-security-desc": "Kami menjaga keamanan data Anda dengan serius dan menerapkan langkah-langkah berikut:",
            "about-security-item-1": "<b>Transmisi Aman:</b> Semua data ditransmisikan melalui koneksi aman (HTTPS), mengenkripsinya antara browser Anda dan server kami.",
            "about-security-item-2": "<b>Autentikasi:</b> Akses ke profil Anda dilindungi oleh token unik dan aman yang dibuat saat login. Token ini diperlukan untuk melihat atau mengedit data Anda.",
            "about-security-item-3": "<b>Redaksi Data:</b> Di halaman profil Anda, informasi sensitif seperti tanggal lahir lengkap dan nomor paspor Anda disembunyikan sebagian untuk melindungi privasi Anda dari pengintaian.",
            "about-security-item-4": "<b>Pengenal Aman:</b> Kami menggunakan token anonim yang dibuat pengguna (`ugt`) untuk membantu mengelola sesi dengan aman tanpa mengekspos informasi pribadi.",
            "about-rights-title": "5. Hak dan Kontrol Anda",
            "about-rights-desc": "Anda memiliki kontrol penuh atas data Anda:",
            "about-rights-item-1": "<b>Perbarui Data Anda:</b> Anda dapat masuk ke profil Anda kapan saja untuk melihat dan memperbarui detail pribadi, kontak, dan universitas Anda.",
            "about-rights-item-2": "<b>Kelola Catatan Organisasi:</b> Anda memiliki kemampuan untuk menambah, mengedit, dan menghapus riwayat PPI Kampus dan PPI Malaysia dari profil Anda.",
            "about-rights-item-3": "<b>Penghapusan Data:</b> Untuk meminta penghapusan lengkap data Anda dari sistem kami, silakan hubungi kami di alamat email di bawah ini.",
            "about-contact-title": "Hubungi Kami",
            "about-contact-desc": "Jika Anda memiliki pertanyaan tentang Kebijakan Perlindungan Data ini atau data Anda, silakan hubungi kami di: "
        },
        "EN": {
            "back-to-home": "Back",
            "about-title": "Data Protection & Privacy",
            "about-last-updated": "Last updated: October 19, 2025",
            "about-purpose-title": "1. Purpose of Data Collection",
            "about-purpose-desc": "This is an official data collection initiative for Indonesian students in Malaysia, coordinated with the Indonesian Embassy (KBRI). The data is essential for administrative support, providing student services, and for emergency contact purposes.",
            "about-what-data-title": "2. What Data We Collect",
            "about-what-data-desc": "We collect the following information to facilitate our services:",
            "about-data-item-1": "<b>Personal Identification:</b> Full Name, Date of Birth, Passport Number.",
            "about-data-item-2": "<b>Contact Information:</b> Phone Number, Email, Full Address, and Postcode.",
            "about-data-item-3": "<b>Educational Data:</b> University, Degree Programme, Education Level, and Expected Graduation Date.",
            "about-data-item-4": "<b>Organizational History:</b> Records of your involvement in PPI Campus and PPI Malaysia.",
            "about-data-item-5": "<b>Technical Data:</b> We collect anonymous technical data, such as screen width and browser user-agent, to improve our service and ensure security.",
            "about-how-use-title": "3. How We Use and Share Your Data",
            "about-how-use-desc": "Your data is used exclusively for official purposes and is shared only under specific circumstances:",
            "about-sharing-item-1": "<b>Primary Use:</b> Data is stored in the main PPI Malaysia database for administrative and emergency contact purposes by authorized personnel.",
            "about-sharing-item-2": "<b>Verification:</b> If you submit a record for PPI Campus or PPI Malaysia, a designated representative from that organization will be able to view and verify your membership status. This is explained in the notes on the registration and profile pages.",
            "about-sharing-item-3": "<b>Third Parties:</b> We do not sell or share your personal data with unauthorized third parties. Access is strictly limited to your PPI Campus and KBRI personnel for official duties.",
            "about-security-title": "4. How We Protect Your Data",
            "about-security-desc": "We take your data security seriously and implement the following measures:",
            "about-security-item-1": "<b>Secure Transmission:</b> All data is transmitted over a secure (HTTPS) connection, encrypting it between your browser and our server.",
            "about-security-item-2": "<b>Authentication:</b> Access to your profile is protected by a secure, unique token generated upon login. This token is required to view or edit your data.",
            "about-security-item-3": "<b>Data Redaction:</b> On your profile page, sensitive information like your full date of birth and passport number is partially hidden to protect your privacy from shoulder-surfing.",
            "about-security-item-4": "<b>Secure Identifiers:</b> We use anonymous, user-generated tokens (`ugt`) to help manage sessions securely without exposing personal information.",
            "about-rights-title": "5. Your Rights and Control",
            "about-rights-desc": "You have full control over your data:",
            "about-rights-item-1": "<b>Update Your Data:</b> You can log in to your profile at any time to view and update your personal, contact, and university details.",
            "about-rights-item-2": "<b>Manage Organizational Records:</b> You have the ability to add, edit, and delete your PPI Campus and PPI Malaysia history from your profile.",
            "about-rights-item-3": "<b>Data Deletion:</b> To request the complete deletion of your data from our system, please contact us at the email address below.",
            "about-contact-title": "Contact Us",
            "about-contact-desc": "If you have any questions about this Data Protection Policy or your data, please contact us at: "
        }
    }
}
